status/src/2022/0218.org
#+TITLE: 12 February 2022 - 18 February 2022

As time goes by quickly

* MIT OCW
** 18.02 - Multiple Variable Calculus
*** Sessions 24-27
** 8.01X+8.01L - Physics I - Classical Mechanics with Labs
*** Still in U/P Chapter 5 reading.
*** Continued Experiment ES
    Analog approach makes some sense but finding more bugs in cgr101-scpi
** 21G.701 Spanish
*** Finished Episodes 10-11
* Barely Working Math, Science, and Engineering Handbook
  Started
  https://github.com/daniel-kelley/bwmse
* CGR-101
** Reworked offset/trigger calculations
*** Verified current offsets are still accurate
*** Somewhat improved trigger offset
    But requested trigger is still offset from actual trigger point by ~13 samples.
* Mill Controller #2
  Potential for using old Compaq iPaq boards.
* Quilting Frame Desk
** Legs roughed out
** Updated design for improved leg bracing
* Space Missions
  Making a list of space missions from NASA, ESA and JAXA.
* David Davies
** Broadcom BCG? Employee indicted for running a brothel.
** New case C1923172, consolidated with *15* Parties.
** Next hearing 4/5/2022.
* Peter Kim
** Broadcom CSG Employee indicted for trade secret theft.
** United States v. Kim (5:21-cr-00438).
** Next hearing: 3/8/2022
