status/2022/0218.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 04:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>12 February 2022 - 18 February 2022</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">12 February 2022 - 18 February 2022</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc7fc85c">1. MIT OCW</a>
<ul>
<li><a href="#org4bfa68e">1.1. 18.02 - Multiple Variable Calculus</a>
<ul>
<li><a href="#orgb75d9ed">1.1.1. Sessions 24-27</a></li>
</ul>
</li>
<li><a href="#orge540606">1.2. 8.01X+8.01L - Physics I - Classical Mechanics with Labs</a>
<ul>
<li><a href="#org7d32e9b">1.2.1. Still in U/P Chapter 5 reading.</a></li>
<li><a href="#orgdc2b085">1.2.2. Continued Experiment ES</a></li>
</ul>
</li>
<li><a href="#orga7b98d4">1.3. 21G.701 Spanish</a>
<ul>
<li><a href="#org9fa2a8c">1.3.1. Finished Episodes 10-11</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgee79790">2. Barely Working Math, Science, and Engineering Handbook</a></li>
<li><a href="#org15c29f0">3. CGR-101</a>
<ul>
<li><a href="#org5fecb81">3.1. Reworked offset/trigger calculations</a>
<ul>
<li><a href="#orgb9797a9">3.1.1. Verified current offsets are still accurate</a></li>
<li><a href="#orgf3a240a">3.1.2. Somewhat improved trigger offset</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8eee164">4. Mill Controller #2</a></li>
<li><a href="#org95b74d2">5. Quilting Frame Desk</a>
<ul>
<li><a href="#orga890ee7">5.1. Legs roughed out</a></li>
<li><a href="#org0c7cc24">5.2. Updated design for improved leg bracing</a></li>
</ul>
</li>
<li><a href="#orgd22bfea">6. Space Missions</a></li>
<li><a href="#org5838e6e">7. David Davies</a>
<ul>
<li><a href="#org5c1746f">7.1. Broadcom BCG? Employee indicted for running a brothel.</a></li>
<li><a href="#org01da46e">7.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#org0aadf63">7.3. Next hearing 4/5/2022.</a></li>
</ul>
</li>
<li><a href="#orgec73e89">8. Peter Kim</a>
<ul>
<li><a href="#org83cd245">8.1. Broadcom CSG Employee indicted for trade secret theft.</a></li>
<li><a href="#org5890722">8.2. United States v. Kim (5:21-cr-00438).</a></li>
<li><a href="#orgcdcd9ac">8.3. Next hearing: 3/8/2022</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
As time goes by quickly
</p>

<div id="outline-container-orgc7fc85c" class="outline-2">
<h2 id="orgc7fc85c"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org4bfa68e" class="outline-3">
<h3 id="org4bfa68e"><span class="section-number-3">1.1.</span> 18.02 - Multiple Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgb75d9ed" class="outline-4">
<h4 id="orgb75d9ed"><span class="section-number-4">1.1.1.</span> Sessions 24-27</h4>
</div>
</div>
<div id="outline-container-orge540606" class="outline-3">
<h3 id="orge540606"><span class="section-number-3">1.2.</span> 8.01X+8.01L - Physics I - Classical Mechanics with Labs</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org7d32e9b" class="outline-4">
<h4 id="org7d32e9b"><span class="section-number-4">1.2.1.</span> Still in U/P Chapter 5 reading.</h4>
</div>
<div id="outline-container-orgdc2b085" class="outline-4">
<h4 id="orgdc2b085"><span class="section-number-4">1.2.2.</span> Continued Experiment ES</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Analog approach makes some sense but finding more bugs in cgr101-scpi
</p>
</div>
</div>
</div>
<div id="outline-container-orga7b98d4" class="outline-3">
<h3 id="orga7b98d4"><span class="section-number-3">1.3.</span> 21G.701 Spanish</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org9fa2a8c" class="outline-4">
<h4 id="org9fa2a8c"><span class="section-number-4">1.3.1.</span> Finished Episodes 10-11</h4>
</div>
</div>
</div>
<div id="outline-container-orgee79790" class="outline-2">
<h2 id="orgee79790"><span class="section-number-2">2.</span> Barely Working Math, Science, and Engineering Handbook</h2>
<div class="outline-text-2" id="text-2">
<p>
Started
<a href="https://github.com/daniel-kelley/bwmse">https://github.com/daniel-kelley/bwmse</a>
</p>
</div>
</div>
<div id="outline-container-org15c29f0" class="outline-2">
<h2 id="org15c29f0"><span class="section-number-2">3.</span> CGR-101</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org5fecb81" class="outline-3">
<h3 id="org5fecb81"><span class="section-number-3">3.1.</span> Reworked offset/trigger calculations</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orgb9797a9" class="outline-4">
<h4 id="orgb9797a9"><span class="section-number-4">3.1.1.</span> Verified current offsets are still accurate</h4>
</div>
<div id="outline-container-orgf3a240a" class="outline-4">
<h4 id="orgf3a240a"><span class="section-number-4">3.1.2.</span> Somewhat improved trigger offset</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
But requested trigger is still offset from actual trigger point by ~13 samples.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org8eee164" class="outline-2">
<h2 id="org8eee164"><span class="section-number-2">4.</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-4">
<p>
Potential for using old Compaq iPaq boards.
</p>
</div>
</div>
<div id="outline-container-org95b74d2" class="outline-2">
<h2 id="org95b74d2"><span class="section-number-2">5.</span> Quilting Frame Desk</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orga890ee7" class="outline-3">
<h3 id="orga890ee7"><span class="section-number-3">5.1.</span> Legs roughed out</h3>
</div>
<div id="outline-container-org0c7cc24" class="outline-3">
<h3 id="org0c7cc24"><span class="section-number-3">5.2.</span> Updated design for improved leg bracing</h3>
</div>
</div>
<div id="outline-container-orgd22bfea" class="outline-2">
<h2 id="orgd22bfea"><span class="section-number-2">6.</span> Space Missions</h2>
<div class="outline-text-2" id="text-6">
<p>
Making a list of space missions from NASA, ESA and JAXA.
</p>
</div>
</div>
<div id="outline-container-org5838e6e" class="outline-2">
<h2 id="org5838e6e"><span class="section-number-2">7.</span> David Davies</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org5c1746f" class="outline-3">
<h3 id="org5c1746f"><span class="section-number-3">7.1.</span> Broadcom BCG? Employee indicted for running a brothel.</h3>
</div>
<div id="outline-container-org01da46e" class="outline-3">
<h3 id="org01da46e"><span class="section-number-3">7.2.</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-org0aadf63" class="outline-3">
<h3 id="org0aadf63"><span class="section-number-3">7.3.</span> Next hearing 4/5/2022.</h3>
</div>
</div>
<div id="outline-container-orgec73e89" class="outline-2">
<h2 id="orgec73e89"><span class="section-number-2">8.</span> Peter Kim</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org83cd245" class="outline-3">
<h3 id="org83cd245"><span class="section-number-3">8.1.</span> Broadcom CSG Employee indicted for trade secret theft.</h3>
</div>
<div id="outline-container-org5890722" class="outline-3">
<h3 id="org5890722"><span class="section-number-3">8.2.</span> United States v. Kim (5:21-cr-00438).</h3>
</div>
<div id="outline-container-orgcdcd9ac" class="outline-3">
<h3 id="orgcdcd9ac"><span class="section-number-3">8.3.</span> Next hearing: 3/8/2022</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-10-28 Sat 04:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>